3 dir显示目录中的文件和子目录列表


dir                 #显示当前目录中的文件和子目录

dir /a              #显示当前目录中的文件和子目录，包括隐藏文件和系统文件

dir c: /a:d         #显示 C 盘当前目录中的目录

dir c:\ /a:-d       #显示 C 盘根目录中的文件dir d:\mp3 /b/p     #逐屏显示 d:\mp3 目录里的文件，只显示文件名，不显示时间和大小

dir *.exe /s显示当前目录和子目录里所有的.exe文件其中 * 是通配符，代表所有的文件名，还一个通配符 ? 代表一个

任意字母或汉字如 c*.* 代表以 c 开头的所有文件?.exe 代表所有文件名是一个字母的.exe文件如果指定的目录或文件

不存在，将返回 errorlevel 为1;每个文件夹的 dir 输出都会有2个子目录 . 和 ... 代表当前目录.. 代表当前目录的


上级目录
dir .               #显示当前目录中的文件和子目录
dir ..              #显示当前目录的上级目录中的文件和子目录
其它参数可参考 dir /?