7 del删除文件
del d:\test.txt     #删除指定文件，不能是隐藏、系统、只读文件
del *.*删除当前目录里的所有文件，不包括隐藏、系统、只读文件，要求按 Y 确认
del /q/a/f d:\temp\*.*删除 d:\temp 文件夹里面的所有文件，包括隐藏、只读、系统文件，不包括子目录
del /q/a/f/s d:\temp\*.*删除 d:\temp 及子文件夹里面的所有文件，包括隐藏、只读、系统文件，不包括子目录


::  /s    使命令同样作用于子目录和文件夹中的文件  sub
::  /q    静默处理命令，使用后命令直接执行，不在需要用户进行确认
::  /p    删除之前先提示确认
::  /f    强制删除只读文件

::  具体的可以在cmd中使用 del /? 来查看，其中/a有点特别，写法有两种,如下

::DEL命令后面加参数/A表示删除指定属性或指定属性以外的文件，/AR、/AH、/AS、/AA分别表示删除只读、隐藏、系统、存档文件，/A-R、/A-H、/A-S、/A-A表示删除除只读、隐藏、系统、存档以外的文件。例如“DEL/AR *.*”表示删除当前目录下所有只读文件，“DEL/A-S *.*”表示删除当前目录下除系统文件以外的所有文件。


