@echo off
set var=今1日明月在
echo %var:~0,2% > G:\3-BAT脚本\3-输出查看\test.txt
exit

::最后，我们来总结一下字符截取的规律：

::1、截取字符串可以用 set var=%str:~数值1,数值2% 这样的语句来实现；
::2、字符的截取是以偏移量来计算的，而不是以字符的绝对位置来计算；
::3、当数值1为正数时，表示从左到右截取；当数值1为负数时，表示从右到左截取；
::4、当数值2为正数时，表示要截取后字符串的长度；当为负数时，表示要抛弃的最后几个字符长度；
::5、当数值2及其之前的逗号不存在时，表示截取的是第（数值1+1）个字符及其之后的所有字符；

::这个语法还可以实现字符串的替换
::set p=alefejfaje
::echo %p:aa=c%          #用c替换变量p中所有的aa，即显示c1bb1c2bb2
::echo %p:aa=%           #将变量p中的所有aa字符串置换为空，即显示1bb12bb2
::echo %p:*bb=c%         #第一个bb及其之前的所有字符被替换为c，即显示
